<?xml version="1.0" ?><policyDefinitionResources revision="1.0" schemaVersion="1.0" xmlns="http://www.microsoft.com/GroupPolicy/PolicyDefinitions"><!--microsoft_edge version: 102.0.1245.30--><displayName/><description/><resources><stringTable><string id="WebView2LoaderOverrideSettings_group">Betöltő felülbírálási beállításai</string><string id="BrowserExecutableFolder">A böngésző végrehajtható fájljait tartalmazó mappa helyének konfigurálása</string><string id="BrowserExecutableFolder_Explain">Ez a házirend konfigurálja a WebView2-alkalmazásokban a megadott elérési úton található WebView2 Runtime használatát. A mappának a következő fájlokat kell tartalmaznia: msedgewebview2.exe, msedge.dll stb.

A mappa elérési út értékének beállításához adja meg az értéknevet és az értékpárt. Az értéknév az alkalmazás felhasználói modellazonosítója vagy a végrehajtható fájl neve legyen. Adja meg a &quot;*&quot; helyettesítő karaktert értéknévként, ha az összes alkalmazásra alkalmazni szeretné.

Mintaérték:

Name: *, Value: C:\Program Files\Microsoft Edge WebView2 Runtime Redistributable 85.0.541.0 x64</string><string id="BrowserExecutableFolderDesc">A böngésző végrehajtható fájljait tartalmazó mappa helyének konfigurálása</string><string id="ReleaseChannelPreference">A kiadási csatorna keresési sorrendjének beállítása</string><string id="ReleaseChannelPreference_Explain">Az alapértelmezett csatornakeresési sorrend a WebView2 Runtime, Beta, dev és Canary.

Az alapértelmezett keresési sorrend megfordításához állítsa ezt a házirendet 1 értékre.

A kiadási csatorna beállítás értékének megadásához adjon meg egy értéknevet és egy értékpárt.  Az értéknév az alkalmazás felhasználói modellazonosítója vagy a végrehajtható fájl neve legyen. Adja meg a &quot;*&quot; helyettesítő karaktert értéknévként, ha az összes alkalmazásra alkalmazni szeretné.

Mintaérték:

Name: *, Value: 1</string><string id="ReleaseChannelPreferenceDesc">A kiadási csatorna keresési sorrendjének beállítása</string><string id="ExperimentationAndConfigurationServiceControl">Kommunikáció szabályozása a Kísérletezési és konfigurációs szolgáltatással</string><string id="ExperimentationAndConfigurationServiceControl_Explain">A Kísérletezési és konfigurációs szolgáltatása a kísérletezési és konfigurációs adattartalom üzembe helyezésére szolgál.

A kísérletezési adattartalom olyan, a fejlesztés korai fázisában lévő funkciók listájából áll, amelyeket a Microsoft tesztelésre és visszajelzés küldésére engedélyez.

A konfigurációs adattartalom olyan beállítások listájából áll, amelyeket a Microsoft üzembe kíván helyezni az alkalmazásban a felhasználói élmény optimalizálása érdekében.

A konfigurációs adattartalom tartalmazhat egy listát is a bizonyos tartományokon kompatibilitási okokból elvégzendő műveletekről. A böngésző például felülbírálhatja a böngészőazonosító sztringet egy webhelyen, ha az adott webhely hibás. Ezen műveletek mindegyike átmeneti céllal lett meghatározva, amíg a Microsoft megpróbálja megoldani a problémát a webhely tulajdonosának bevonásával.

Ha a házirendben a „FullMode” módot állítja be, a rendszer a teljes adattartalmat letölti a Kísérletezési és konfigurációs szolgáltatásból. Ez magában foglalja a kísérletezési és a konfigurációs adattartalmat is.

Ha a házirendben a „ConfigurationsOnlyMode” módot állítja be, akkor csak a konfigurációs adattartalom kézbesítése történik meg.

Ha a házirendben a „RestrictedMode” módot állítja be, a Kísérletezési és konfigurációs szolgáltatással folytatott kommunikáció teljesen leáll. A Microsoft nem javasolja ezt a beállítást.

Ha nem konfigurálja ezt a házirendet egy felügyelt eszközökön, a viselkedés ugyanaz, mint a „ConfigurationsOnlyMode” mód esetén. A Canary és Dev csatornákon a viselkedés ugyanaz, mint a „FullMode“ mód esetén.

Ha nem konfigurálja ezt a házirendet a nem felügyelt eszközökön, a viselkedés ugyanaz, mint a „FullMode” mód esetén.

Házirendbeállítások leképezése:

* FullMode (2) = Konfigurációk és kísérletek beolvasása

* ConfigurationsOnlyMode (1) = Csak a konfigurációk beolvasása

* RestrictedMode (0) = Kommunikáció letiltása a Kísérletezési és konfigurációs szolgáltatással

Használja az előző információt a házirend konfigurálásakor.</string><string id="ExperimentationAndConfigurationServiceControl_FullMode">Konfigurációk és kísérletek beolvasása</string><string id="ExperimentationAndConfigurationServiceControl_ConfigurationsOnlyMode">Csak a konfigurációk beolvasása</string><string id="ExperimentationAndConfigurationServiceControl_RestrictedMode">Kommunikáció letiltása a Kísérletezési és konfigurációs szolgáltatással</string><string id="SUPPORTED_WIN7_V97">A(z) Microsoft Edge 97 verziója, Windows 7 vagy újabb verzió</string><string id="SUPPORTED_WIN7_V87">A(z) Microsoft Edge 87 verziója, Windows 7 vagy újabb verzió</string><string id="microsoft_edge_webview2">Microsoft Edge WebView2</string><string id="microsoft_edge_webview2_recommended">Microsoft Edge WebView2 - Alapértelmezett beállítások (a felhasználók felülbírálhatják)</string></stringTable><presentationTable><presentation id="BrowserExecutableFolder"><listBox refId="BrowserExecutableFolderDesc">Állítsa be az érték nevét az alkalmazás felhasználói modellazonosítójára vagy a végrehajtható fájl nevére. Használhatja a „*” helyettesítő karaktert az érték neveként, ha az összes alkalmazásra szeretne hivatkozni.</listBox></presentation><presentation id="ReleaseChannelPreference"><listBox refId="ReleaseChannelPreferenceDesc">Állítsa be az érték nevét az alkalmazás felhasználói modellazonosítójára vagy a végrehajtható fájl nevére. Használhatja a „*” helyettesítő karaktert az érték neveként, ha az összes alkalmazásra szeretne hivatkozni.</listBox></presentation><presentation id="ExperimentationAndConfigurationServiceControl"><dropdownList refId="ExperimentationAndConfigurationServiceControl">Kommunikáció szabályozása a Kísérletezési és konfigurációs szolgáltatással</dropdownList></presentation></presentationTable></resources></policyDefinitionResources>